"""
bhch08exrc05.py: Write a simple quote-of-the-day program. The program should contain a list of quotes, and when the user runs the program, a randomly selected quote should be printed.
"""
print('*'*80)

from random import randint

quotes = [
	'ವಿವೇಕಿಯಾದವನು ಇನ್ನೊಬ್ಬರು ನಿಂದಿಸಬಹುದಾದ ಕಾರ್ಯವನ್ನು ಮಾಡಬಾರದು.  - ರಾಮಾಯಣ',
	'ಉದ್ವೇಗದಿಂದ ಬುದ್ಧಿಹಾನಿಯಾಗುತ್ತದೆ. ಬುದ್ಧಿಭ್ರಮೆಯಾದರೆ ಹುಚ್ಚು ಎನ್ನುತ್ತಾರೆ.  - ಸೂಕ್ತಿ ಸುಧಾರ್ಣವಂ',
	'ಉಪಾಯವನ್ನು ತಿಳಿದವನಿಗೆ ಯಾನ ಕೆಲಸವೂ ಸಣ್ಣದೂ ಅಲ್ಲ, ದೊಡ್ಡದೂ ಅಲ್ಲ.  - ಸೋಮದೇವ ನೀತಿಸೂತ್ರ',
	'ಉನ್ನತಿಯನ್ನು ಬಯಸುವ ಮನುಷ್ಯನು ಮನಸ್ಸಿಗೆ ಬಂದಂತೆ ನಡೆಯಬಾರದು.  - ಕಥಾಸರಿತ್ಸಾಗರ',
	'ಟೀಕೆಯನ್ನು ಗ್ರಹಿಸುವುದಕ್ಕೆ ಟಿಪ್ಪಣಿಬೇಕು.  - ಲೋಕೋಕ್ತಿ'
]

print('QUOTE OF THE DAY')
print('~'*80)
print(quotes[randint(1, len(quotes))])
print('~'*80)

print('*'*80)
"""PROGRAM OUTPUT
@@@@ Trial1:
********************************************************************************
QUOTE OF THE DAY
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ಟೀಕೆಯನ್ನು ಗ್ರಹಿಸುವುದಕ್ಕೆ ಟಿಪ್ಪಣಿಬೇಕು.  - ಲೋಕೋಕ್ತಿ
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
********************************************************************************

@@@@ Trial2:
********************************************************************************
QUOTE OF THE DAY
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ಉನ್ನತಿಯನ್ನು ಬಯಸುವ ಮನುಷ್ಯನು ಮನಸ್ಸಿಗೆ ಬಂದಂತೆ ನಡೆಯಬಾರದು.  - ಕಥಾಸರಿತ್ಸಾಗರ
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
********************************************************************************
"""